src/test/resources/betamax/tapes/Reporting/can_generate_payment_report.yaml

name: can_generate_payment_report
interactions:
- request:
    method: POST
    uri: http://localhost:5555/v2/reports/payments/create
    body: description=Payment+test+report&currency=EUR&amount_from=0.00&amount_to=99999.99&created_at_from=2018-01-01T00%3A00%3A00Z&created_at_to=2018-12-31T00%3A00%3A00Z&unique_request_id=94985dc8-1df3-4f8a-ba23-d00cf284708d
    headers:
      X-Auth-Token:
      - 334cbfdb9ba9bfb6ffd499b0c6af6b12
      User-Agent:
      - CurrencyCloudSDK/2.0 Java/1.7.4
  response:
    status: 200
    headers:
      Server:
      - nginx
      Date:
      - Mon, 01 Jan 2018 12:34:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '650'
      Connection:
      - keep-alive
      X-Request-Id:
      - '3533958966381289254'
      X-Content-Type-Options:
      - nosniff
    body: '{"short_reference":"RP-6846174-EQFOHU","contact_id":"590cea0d-0daa-48dc-882b-049107c1471f","description":"Payment test report","report_url":"",
    "search_params":{"currency":"EUR","amount_from":0.00,"amount_to":99999.99,"created_at_from":"2018-01-01T00:00:00+00:00","created_at_to":"2018-12-31T00:00:00+00:00",
    "scope":"own","unique_request_id":"94985dc8-1df3-4f8a-ba23-d00cf284708d"},"report_type":"payment","account_id":"e277c9f9-679f-454f-8367-274b3ff977ff",
    "created_at":"2018-01-01T12:34:56+00:00","failure_reason":null,"id":"39a0ebd1-13b3-4d38-a196-745e5944f169","status":"processing","expiration_date":null,
    "updated_at":"2018-01-01T12:34:56+00:00"}'
